In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("salaries.csv")
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,MI,FT,Analytics Engineer,77500,CAD,59615,CA,100,CA,S
1,2024,SE,FT,AI Developer,252000,USD,252000,US,0,US,M
2,2024,SE,FT,AI Developer,168000,USD,168000,US,0,US,M
3,2024,MI,FT,Data Scientist,199500,USD,199500,US,100,US,M
4,2024,MI,FT,Data Scientist,86700,USD,86700,US,100,US,M

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18056 entries, 0 to 18055
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           18056 non-null  int64
 1   experience_level    18056 non-null  object
 2   employment_type     18056 non-null  object
 3   job_title           18056 non-null  object
 4   salary              18056 non-null  int64
 5   salary_currency     18056 non-null  object
 6   salary_in_usd       18056 non-null  int64
 7   employee_residence  18056 non-null  object
 8   remote_ratio        18056 non-null  int64
 9   company_location    18056 non-null  object
 10  company_size        18056 non-null  object
dtypes: int64(4), object(7)
memory usage: 1.5+ MB

In [4]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
work_year,18056.0,2023.292036,0.715810,2020.0,2023.0,2023.0,2024.0,2024.0
salary,18056.0,163875.139123,326562.877696,14000.0,104000.0,143000.0,190000.0,30400000.0
salary_in_usd,18056.0,150856.152913,68728.941915,15000.0,103500.0,142200.0,188500.0,800000.0
remote_ratio,18056.0,30.884471,45.828340,0.0,0.0,0.0,100.0,100.0

In [5]:
df.describe(include='object')

,experience_level,employment_type,job_title,salary_currency,employee_residence,company_location,company_size
count,18056,18056,18056,18056,18056,18056,18056
unique,4,4,143,24,88,77,3
top,SE,FT,Data Scientist,USD,US,US,M
freq,11486,17974,4284,16772,15899,15950,16767

In [6]:
df.shape

(18056, 11)

In [7]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [8]:
df.isnull().sum().sum()

0

In [9]:
df.duplicated().sum()

7380

In [10]:
df =  df.drop_duplicates()

In [11]:
df.duplicated().sum()

0

In [16]:
df.shape

(10676, 11)

In [12]:
df['experience_level'].unique()

array(['MI', 'SE', 'EN', 'EX'], dtype=object)

In [13]:
df['experience_level'].value_counts()

SE    6199
MI    2972
EN    1102
EX     403
Name: experience_level, dtype: int64

In [14]:
df['employment_type'].unique()

array(['FT', 'CT', 'PT', 'FL'], dtype=object)

In [15]:
df['employment_type'].value_counts()

FT    10594
PT       38
CT       30
FL       14
Name: employment_type, dtype: int64

In [17]:
df['salary_currency'].unique()

array(['CAD', 'USD', 'GBP', 'EUR', 'SEK', 'PLN', 'INR', 'DKK', 'ILS',
       'BRL', 'CHF', 'NZD', 'AUD', 'PHP', 'TRY', 'NOK', 'JPY', 'ZAR',
       'HKD', 'SGD', 'THB', 'HUF', 'MXN', 'CLP'], dtype=object)

In [18]:
df['salary_currency'].value_counts()

USD    9608
GBP     493
EUR     395
CAD      58
INR      56
AUD      12
PLN       8
CHF       8
SGD       6
BRL       5
JPY       4
DKK       4
HUF       3
TRY       3
NOK       2
THB       2
ILS       2
NZD       1
SEK       1
PHP       1
HKD       1
CLP       1
MXN       1
ZAR       1
Name: salary_currency, dtype: int64

In [19]:
currency_counts = df['salary_currency'].value_counts()
df['salary_currency'] = df['salary_currency'].apply(lambda x: 'Other' if currency_counts[x] < 7 else x)
df['salary_currency'].value_counts()

USD      9608
GBP       493
EUR       395
CAD        58
INR        56
Other      38
AUD        12
PLN         8
CHF         8
Name: salary_currency, dtype: int64

In [21]:
df['job_title'].unique()

array(['Analytics Engineer', 'AI Developer', 'Data Scientist',
       'Research Engineer', 'Research Scientist', 'Data Engineer',
       'Data Analyst', 'Applied Scientist', 'Machine Learning Engineer',
       'Data Architect', 'Business Intelligence Analyst',
       'Research Analyst', 'Data Analytics Manager',
       'Data Product Manager', 'Data Analytics Lead',
       'Business Intelligence Engineer', 'Data Manager',
       'Machine Learning Scientist', 'Prompt Engineer', 'Insight Analyst',
       'BI Analyst', 'AI Engineer', 'Business Intelligence Lead',
       'BI Developer', 'Data Operations Analyst',
       'Data Reporting Analyst', 'Business Intelligence Developer',
       'Data Product Owner', 'Data Specialist', 'Business Intelligence',
       'MLOps Engineer', 'Data Visualization Specialist', 'AI Architect',
       'Data Quality Analyst', 'Lead AI Engineer', 'AI Product Manager',
       'Data Management Specialist', 'Data Strategist',
       'AI Software Engineer', 'Computer Vision Engineer',
       'Robotics Engineer', 'Robotics Software Engineer',
       'Machine Learning Researcher', 'Data Modeler', 'Data Lead',
       'AI Scientist', 'Data Infrastructure Engineer',
       'Data Integration Engineer', 'Machine Learning Developer',
       'Machine Learning Manager', 'AI Software Development Engineer',
       'Master Data Specialist', 'Machine Learning Modeler',
       'NLP Engineer', 'Data Operations Manager',
       'Data Integration Specialist', 'Data Management Analyst',
       'Encounter Data Management Professional',
       'Data Analytics Specialist', 'Head of Data',
       'Admin & Data Analyst', 'Consultant Data Engineer',
       'Business Intelligence Manager', 'Manager Data Management',
       'Data Quality Manager', 'Business Intelligence Specialist',
       'Director of Business Intelligence', 'AI Research Scientist',
       'Data Operations Specialist', 'Bear Robotics',
       'Data Operations Associate', 'Lead Data Scientist',
       'Applied Research Scientist',
       'Machine Learning Infrastructure Engineer', 'Data Developer',
       'CRM Data Analyst', 'ETL Developer', 'Cloud Database Engineer',
       'BI Data Analyst', 'Applied Data Scientist',
       'Data Quality Engineer', 'Computational Biologist',
       'Big Data Engineer', 'Data Analytics Associate',
       'Data Management Consultant', 'Data DevOps Engineer',
       'Big Data Developer', 'Quantitative Research Analyst',
       'Lead Machine Learning Engineer',
       'Machine Learning Research Engineer', 'Data Analytics Consultant',
       'AI Research Engineer', 'AI Programmer', 'ETL Engineer',
       'Head of Machine Learning', 'Data Analyst Lead',
       'Data Integration Developer', 'Data Pipeline Engineer',
       'Lead Data Analyst', 'Business Data Analyst',
       'Marketing Data Scientist', 'Deep Learning Engineer',
       'Decision Scientist', 'Financial Data Analyst',
       'Data Strategy Manager', 'Data Visualization Engineer',
       'Azure Data Engineer', 'Principal Data Scientist',
       'Staff Data Analyst', 'Machine Learning Software Engineer',
       'Applied Machine Learning Scientist', 'Data Operations Engineer',
       'Principal Machine Learning Engineer', 'Principal Data Engineer',
       'Power BI Developer', 'Staff Machine Learning Engineer',
       'Staff Data Scientist', 'Machine Learning Specialist',
       'Business Intelligence Data Analyst', 'Finance Data Analyst',
       'Software Data Engineer', 'Compliance Data Analyst',
       'Cloud Data Engineer', 'Analytics Engineering Manager',
       'AWS Data Architect', 'Product Data Analyst',
       'Data Visualization Analyst', 'Autonomous Vehicle Technician',
       'Sales Data Analyst', 'Applied Machine Learning Engineer',
       'BI Data Engineer', 'Deep Learning Researcher',
       'Big Data Architect', 'Computer Vision Software Engineer',
       'Marketing Data Engineer', 'Data Science Tech Lead',
       'Data Scientist Lead', 'Marketing Data Analyst',
       'Principal Data Architect', 'Data Analytics Engineer',
       'Cloud Data Architect', 'Lead Data Engineer',
       'Principal Data Analyst'], dtype=object)

In [22]:
df['remote_ratio'].unique()

array([100,   0,  50], dtype=int64)

In [23]:
df['state'] = df['remote_ratio'].apply(lambda x: 'Remote' if x == 100 else ('On-Site' if x == 0 else 'Hybrid'))

In [24]:
df.sample(10)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,state
10836,2023,MI,FT,Data Analyst,67500,USD,67500,US,0,US,M,On-Site
6360,2024,MI,FT,BI Developer,43626,GBP,54532,GB,0,GB,M,On-Site
409,2024,SE,FT,Data Engineer,165000,USD,165000,US,100,US,M,Remote
3665,2024,MI,FT,Machine Learning Scientist,720000,USD,720000,US,0,US,M,On-Site
9332,2023,SE,FT,Data Analyst,103200,USD,103200,US,0,US,M,On-Site
8796,2023,EN,FT,Data Scientist,40000,EUR,43187,ES,0,ES,M,On-Site
11258,2023,EX,FT,Data Scientist,250300,USD,250300,US,100,US,M,Remote
2774,2024,SE,FT,Data Scientist,162000,USD,162000,US,0,US,M,On-Site
12833,2023,SE,FT,Business Intelligence Analyst,200000,USD,200000,US,100,US,M,Remote
7293,2024,SE,FT,Data Engineer,94100,USD,94100,US,0,US,M,On-Site

In [27]:
df.to_csv('Salaries.csv', index=False)
df.to_excel('Salaries.xlsx', index=False)
from IPython.display import FileLink
display(FileLink('Salaries.csv'))
display(FileLink('Salaries.xlsx'))

C:\Users\HP\Downloads\Salaries.csv

C:\Users\HP\Downloads\Salaries.xlsx